{
  "data": {
    "lesson": {
      "id": 728804,
      "key": "368c9af3-c8b8-4b01-92ba-40d7e989d6e7",
      "title": "Jobs in Deep Learning",
      "semantic_type": "Lesson",
      "is_public": true,
      "version": "1.0.0",
      "locale": "en-us",
      "summary": "To kick off your industry research, learn about real world applications of Deep Learning and common questions about jobs in this field.",
      "lesson_type": "Classroom",
      "display_workspace_project_only": false,
      "resources": null,
      "project": null,
      "lab": null,
      "concepts": [
        {
          "id": 728806,
          "key": "900d740a-e47d-4b67-be4c-ca27ea8981e2",
          "title": "Jobs in Deep Learning",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "900d740a-e47d-4b67-be4c-ca27ea8981e2",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 728807,
              "key": "fb5b30ed-00ef-419f-a2ea-41dac6ce42b3",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Jobs in Deep Learning \n# 6 Questions About Deep Learning Jobs\n## 1. How do I break into the deep learning industry?\nDeep learning and related fields in AI are so fast-moving. Find opportunities by staying on top of new developments and taking note of improvements on existing architectures. Many employers value people who can think critically about what works and what doesn’t in data sources and deep learning techniques, so the more you read and try out different formulations on your own, the better! You’re also encouraged to keep track of your learning via a shared blog or personal GitHub.\n\nWe recommend a 4-part strategy to finding opportunities in deep learning.\n1. **Stay updated on thought leadership.** Start every morning reading a 10-minute blog post on [Medium](https://medium.com/tag/deep-learning) or by scrolling your Twitter feed. You can find an extensive list of the machine learning community on Twitter in this [blog post](https://blog.udacity.com/2018/09/machine-learning-ai-experts-on-twitter.html). Authors tend to link to larger research papers for further insights and learnings.\n2. **See how deep learning fits into common image analysis and machine learning roles**, ranging from machine learning engineer to data analyst to software engineer. Do job searches based on skills (such as natural language processing, bayesian statistics, and convolutional neural networks) and keywords (such as artificial intelligence, and ML frameworks), rather than job title. You will find more opportunities that are a fit for your skills and interests.\n3. **Create your own deep learning application and share it!** Job seekers ask Udacity Careers all the time on how to talk about their skills and experiences - better than talking is showing. Develop your own app or product (it can be a small, personal project!), put the work online (ie: upload your code on GitHub), and then write a blog post documenting the development process and purpose of the project. You can pursue both software and hardware projects. Implementing deep learning papers is one of the best ways to show off your skills and continue learning.\n * Software ideas: Run deep learning models with [AWS Deeplens](https://aws.amazon.com/deeplens/). You can also get inspired by what other people are doing - right now on Medium, many people are blogging about their [TensorFlow](https://www.tensorflow.org/) and [PyTorch](https://pytorch.org/) projects.\n * Hardware ideas: [Raspberry Pis](https://www.raspberrypi.org/) are cheap compute boards and Google released the [AIY Vision Kit](https://blog.google/technology/ai/introducing-aiy-vision-kit-make-devices-see/) in 2017. Share what you create by writing a blog about the experience and become a part of the larger community by hashtagging #AIYProjects. \n4. **Read a recent paper and write about your interpretation.** Employers often want to see that students are up-to-date with the latest research. So, if you’ve read a recent paper and thought critically about how it can be explained in plain language or implemented in code, then you can demonstrate your understanding by writing about it! Communication skills are valuable in this growing field; writing understandable blog posts and showing your work as you learn about deep learning will make you more visible to employers and the deep learning community at large.\n\n## 2. What are the key knowledge/skills that are useful to work on deep learning as an engineer?\n\nIn the Deep Learning Nanodegree program, you will gain insights into and practice these core deep learning skills:\n\n* Building and training neural networks\n* Model evaluation and validation\n* Convolutional neural networks\n* Autoencoders and feature extraction\n* Transfer learning\n* Recurrent neural networks\n* Natural language processing\n* Data augmentation\n* Generative adversarial networks\n* Hyperparameter tuning\n* Model deployment and serving\n\nTo become a better job candidate, dive deeper into the following concepts, beyond the Nanodegree program. A few more ideas include:\n* Exploring domains such as computer vision, natural language processing, and/or deep reinforcement learning through our other School of AI Nanodegree programs or other resources\n* Advancing your programming competency in C++  (a useful language for working with hardware)\n* Learning how to build networks in both PyTorch and TensorFlow\n* Working with SQL and applying data analysis skills, specifically, how can you clean data or work with very small or large datasets\n\nAlthough the above is by no means an exhaustive list, taking the time to pick up any of these these technologies will only strengthen your chances of moving forward in an application process.\n\n## 3. Could I apply for deep learning jobs?\nCompanies investing in cutting-edge technologies often look for candidates with deep learning knowledge. For example, [Athelas](http://athelas.com/technology/) uses deep learning to count white blood cells. Companies like Spotify, Twitter, and more use machine learning skills to improve their recommendation engines. Deep learning is being used more and more often as a skill in traditional data analysis roles.\n\nThere is a lack of engineers who can both build deep learning models and deploy those models to production. By completing the projects in this Nanodegree program, you’ll have all the necessary skills to find jobs anywhere in industry.\n\n\n## 4. What are some job titles in deep learning?\n\n*Tip*: Remember that there are so many roles available related in deep learning. Instead of searching for job titles, consider finding top AI startups and companies and looking at their overall jobs page.\n\nMany companies, when advertising for roles requiring deep learning skills, use substitute terms. You may find these terms in job postings, rather than \"deep learning\" itself. Remember to read the job listing carefully. You’ll often see job titles with AI or artificial intelligence, which really means deep learning.\n\nHere are **common titles** of jobs in deep learning:\n\n* Machine Learning Engineer\n* Deep Learning Engineer\n* Machine Learning Researcher, Deep learning\n* Applied Research Scientist\n* Software Engineer, Machine Learning\n* Data Scientist\n\n## 5. What do typical deep learning engineers do in their day-to-day?\nAlthough you will find jobs, especially in Silicon Valley, labelled \"deep learning engineer\", you are most likely to find other roles (such as \"applied researcher\" or \"data scientist\") that ask for deep learning skills. Do [Boolean searches](https://www.linkedin.com/help/linkedin/answer/75814/using-boolean-search-on-linkedin?lang=en) that combine some of your background with deep learning skills. Many smaller companies not yet established in the AI field may be looking for a generalist first, to pave the way for their data team. \n\nSome common work duties you will find in job postings are:\n\n* Design and build machine intelligence features\n* Develop machine learning algorithms related to deep learning, such as object detection, language translation, and image retrieval in search algorithms\n* Deploy analytics models in production and evaluate their scalability\n* Code in C++ and Python\n* Use ML frameworks such as PyTorch and Tensorflow to implement and prototype deep learning models\n* Monitor and update a model after it has been deployed to production\n* Employ data augmentation to work with small datasets\n* Collaborate with other data and engineering teams on hardware, software architecture hardware and quality assurance\n\n\n## 6. Okay, I know all of this now. What should I do next?\nRight now, you are learning the foundational skills for a career in deep learning. Focus on your learning, and imagine yourself in different roles. We recommend performing a [job search](https://career-resource-center.udacity.com/job-boards) to see what's out there.\n\nWe'll help you get started. We searched for \"deep learning\" jobs worldwide on LinkedIn. Click the button below to see the search results. Change your search terms and apply filters. Once you have an idea of which jobs or companies you may be interested in, read about the companies or find personal blogs by people working in those roles. You can even reach out to people for [informational interviews](https://career-resource-center.udacity.com/networking/informational-interviews).\n\n<center><a href=\"https://www.linkedin.com/jobs/search/?keywords=deep%20learning&location=Worldwide&locationId=OTHERS.worldwide\" target=\"_blank\"><button style=\"box-sizing: border-box; border-radius: 4px; background: #02B3E4; border: none; height: 44px; padding: 0 25px; color: white; cursor: pointer; font-family: Open Sans,sans-serif; display: inline-block; border: none; font-size: 12px; letter-spacing: 1px; font-weight: 600; text-transform: uppercase;\">Go to LinkedIn Search</button></a></center><br>\n\nAfter you spend some time looking at various jobs available to you, come back to the Classroom to continue.\n\n",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 728809,
          "key": "7a4351c0-9a03-4b27-86dd-1cb7f291e728",
          "title": "Real-World Applications of Deep Learning",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "7a4351c0-9a03-4b27-86dd-1cb7f291e728",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 728810,
              "key": "0eeac39c-0fd1-4a25-b6e0-235b8bde33d4",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Real-World Applications of Deep Learning\n\nFrom health applications to the autonomous vehicle space to language translation, and recommendation engines, deep learning skills are needed in a variety of fields. Here are just a few examples:\n\n## Language Translation\n\nDeep learning and recurrent neural networks are used to learn the mappings from one language to another. This is done with an encoder-decoder framework that can take an a sequence of words in one language and generate a corresponding sequence in another language. These sequences can be of variable length and are not even restricted to words; models can learn to generate a descriptive caption given an input image or to automatically translate sign language. These models can give people the ability to communicate with one another around the world.\n\n## Optimizing Traffic Signals and Self-Driving Cars\n\nDeep learning can be used in city planning to optimize for housing affordability, efficient public transportation routes and more. Recently, it’s been used to look at the times of day and traffic congestion in parts of a city and plan the most efficient traffic signal patterns to help traffic flow efficiently and safely.\n\nDeep learning is also used for vehicle and pedestrian recognition and tracking (to determine their speed and predict movement). Check out [this blog](https://www.linkedin.com/pulse/how-computer-vision-works-self-driving-cars-david-silver/) from David Silver on how deep learning works for self-driving cars.\n\n## Predicting Consumer Behavior\n\nDeep learning is widely used in recommending music, videos, and other content to users of an app based on their previous history. For example, Spotify looks at the artists a user listens to, what genres, tempo, and bass level they tend to prefer and they create a Discover Weekly playlist based on these variables. Deep learning is used to extrapolate based on existing user data and predict what people may want to hear or see.\n\n## Up Next\nBy now, you have made progress in your Nanodegree program and gotten an overview of jobs in deep learning. You should feel comfortable seeking out information online to further your knowledge of the community and new developments in the field. You should also know how to find deep learning and related jobs on job boards.",
              "instructor_notes": ""
            }
          ]
        }
      ]
    }
  }
}